# Задача 1. Новые списки
# Даны три списка:
#
#
#
# floats: List[float] = [12.3554, 4.02, 5.777, 2.12, 3.13, 4.44, 11.0001]
#
# names: List[str] = ["Vanes", "Alen", "Jana", "William", "Richards", "Joy"]
#
# numbers: List[int] = [22, 33, 10, 6894, 11, 2, 1]
#
#
#
# Напишите код, который создаёт три новых списка. Вот их содержимое:
#
# Каждое число из списка floats возводится в третью степень и округляется до трёх знаков после запятой.
# Из списка names берутся только те имена, в которых есть хотя бы пять букв.
# Берётся произведение всех чисел из списка numbers.
