# Задача 5. Палиндром: возвращение
# Для Python существует огромное количество различных библиотек для работы с данными, причём как встроенных, так и внешних. С некоторыми из них мы уже работали, например с модулем collections, когда использовали специальный класс OrderedDict, с помощью которого делали упорядоченный словарь. Конечно же, в библиотеке есть и другие возможности (на самом деле их совсем немного), вот официальная документация: collections — Container datatypes — Python 3.9.5 documentation.
#
# Используя моуль collections и новые знания о функциях, реализуйте функцию can_be_poly, которая принимает на вход строку и проверяет, можно ли получить из неё палиндром.
#
#
#
# Пример кода:
#
# print(can_be_poly('ababc'))
#
# print(can_be_poly('abbbc'))
#
#
# Результат:
#
# True
#
# False
