# Задача 5. Весёлая ферма 2
# Мы продолжаем писать игру «Весёлая ферма» и теперь необходимо её немного модернизировать. Всё-таки кому-то же нужно собирать урожай,
# и для этого нам понадобится садовник, который имеет:
#
# Имя.
# Грядку с растением, за которым он ухаживает (в нашем случае пока только грядка с картошкой).
#
#
# И может:
#
# Ухаживать за грядкой.
# Собирать с неё урожай (количество картошки ― пустой список).
#
#
# Модернизируйте программу, используя новый класс «Садовник». На всякий случай вот описание картошки и грядки:
#
# У картошки есть её номер в грядке, а также стадия зрелости. Она может предоставлять информацию о своей зрелости и расти. Всего у картошки может быть четыре стадии зрелости.
#
# Грядка с картошкой содержит список картошки, которая на ней растёт, и может, собственно, взращивать всю эту картошку, а также предоставлять информацию о зрелости всей
# картошки на своей территории.
#
#
#
# Проверьте работу программы, создав грядку из пяти картошек и отдав эту грядку садовнику. Пусть поухаживает за грядкой и соберёт урожай (а, может быть, даже и не один).