# Задача 5. Пароль
#
# При регистрации на сайте помимо логина нужно ещё придумать надёжный пароль. Этот пароль должен состоять минимум из восьми символов,
# в нём должна быть хотя бы одна большая буква и хотя бы три цифры. Тогда он будет считаться надёжным.
#
# Напишите программу, которая запрашивает у пользователя пароль до тех пор, пока он не введёт надежный пароль. Используется латиница.
#
#
#
# Пример:
#
# Придумайте пароль: qwerty
#
# Пароль ненадёжный. Попробуйте ещё раз.
#
# Придумайте пароль: qwerty12
#
# Пароль ненадёжный. Попробуйте ещё раз.
#
# Придумайте пароль: qwerty123
#
# Пароль ненадёжный. Попробуйте ещё раз.
#
# Придумайте пароль: qWErty123
#
# Это надёжный пароль!