# Задача 9. Война и мир (необязательная)
#
# Мало кто не знает про знаменитый роман Л. Н. Толстого «Война и мир». Это довольно объёмное произведение лежит в архиве voina-i-mir.zip.
# Напишите программу, которая подсчитает статистику по буквам (не только русского алфавита) в этом романе и выведет результат на экран (или в файл).
# Результат должен быть отсортирован по частоте встречаемости букв (по возрастанию или убыванию). Регистр символов имеет значение.
#
# Постарайтесь написать программу так, чтобы для её работы не требовалась распаковка архива «вручную».
#
#
#
