# Задача 3. Моделирование
#
# В проекте по 3D-моделированию используются две фигуры — куб и пирамида.
# Для моделирования этих фигур используются соответствующие 2D-фигуры, а именно квадрат и треугольник.
# Вся поверхность 3D-фигуры может храниться в виде списка, например: для куба это будет [Square, Square, Square, Square, Square, Square].
#
#
#
#
#
#
# Квадрат инициализируется длинами сторон, а треугольник — основанием и высотой. Каждая из 2D-фигур умеет находить свои периметр и площадь,
# а 3D-фигуры, в свою очередь, могут находить площадь своей поверхности.
#
#
#
# Используя входные данные о фигурах и знания математики, реализуйте соответствующие классы и методы. Для базовых классов также реализуйте геттеры и сеттеры.