# Задача 3. Во все тяжкие
# Фанаты сериала Breaking Bad («Во все тяжкие») написали собственный API по вселенной своего любимого сериала. Вот ссылка на документацию.
#
#
#
# Внимательно изучите документацию этого API и напишите программу, которая выводит на экран (а также в JSON-файл) информацию о том, в каком эпизоде произошло больше всего смертей. Информация хранится в виде словаря, который содержит:
#
# ID эпизода.
# Номер сезона.
# Номер эпизода.
# Общее количество смертей.
# Список погибших.