# Задача 5. Кино
#
# Илья зашёл на один любительский киносайт, где пользователи пишут рецензии на фильмы. Вот, кстати, список этих фильмов:
#
#
#
# films = [‘Крепкий орешек’, ‘Назад в будущее’, ‘Таксист’, ‘Леон’, ‘Богемская рапсодия’, ‘Город грехов’, ‘Мементо’, ‘Отступники’, ‘Деревня’]
#
#
#
# Илья на сайте в первый раз, он хочет зарегистрироваться и сразу добавить некоторые фильмы в список своих любимых, чтобы потом почитать рецензии на них.
# Напишите программу, в которой пользователь вводит фильм, и если он есть в списке, то он добавляется в список любимых. Если его нет, то выводится ошибка.
# В конце выведите весь список любимых фильмов.
#
